In [10]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame
print('Modules are imported.')

Modules are imported.

In [11]:
nan = np.nan
left_dfl = DataFrame ({ 'Category': (["Electronics", "Men's clothing", "Women's clothing"]),
                'Sales - in units' : np.array([1, 3, 5])})
left_dfl

           Category  Sales - in units
0       Electronics                 1
1    Men's clothing                 3
2  Women's clothing                 5

In [12]:
nan = np.nan
right_dfr= DataFrame ({ 'Category': (["Electronics", "Children's clothing", "pet's clothing"]),
                'Sales - in units' : np.array([1, 6, 6])})
right_dfr

              Category  Sales - in units
0          Electronics                 1
1  Children's clothing                 6
2       pet's clothing                 6

__Left Outer Join__

In [13]:
pd.merge(left_dfl, right_dfr, on='Category', how='left')

           Category  Sales - in units_x  Sales - in units_y
0       Electronics                   1                 1.0
1    Men's clothing                   3                 NaN
2  Women's clothing                   5                 NaN

__Right Outer Join__

In [14]:
pd.merge(left_dfl, right_dfr, on='Category', how='right')

              Category  Sales - in units_x  Sales - in units_y
0          Electronics                 1.0                   1
1  Children's clothing                 NaN                   6
2       pet's clothing                 NaN                   6

__Outer Join__

In [15]:
pd.merge(left_dfl, right_dfr, on='Category', how='outer')

              Category  Sales - in units_x  Sales - in units_y
0          Electronics                 1.0                 1.0
1       Men's clothing                 3.0                 NaN
2     Women's clothing                 5.0                 NaN
3  Children's clothing                 NaN                 6.0
4       pet's clothing                 NaN                 6.0

If you have column names that are different.

Lets say that in the left_df your column is called 'Category', but the right_df is called 'Categories'.

You can use 
pd.merge(left_df, right_df, left_on='Category', right_on='Categories')